/*

상근이는 성공한 벤쳐회사 "봉씨"에 지원했다. 오늘은 그의 면접날이다. 하지만, 늦잠을 잔 상근이는 봉씨가 있는 건물에 늦게 도착했다.

봉씨는 고층 건물에 사무실이 있고, 상근이는 지금 s층에 있고 이제 막 엘리베이터를 탔다.

이 엘리베이터는 동혁이가 설계한 엘리베이터이다. 3598번에서 설계한 엘리베이터는 버튼이 4개 있었지만, 이 엘리베이터는 버튼이 "UP u", "DOWN d" 밖에 없다.

UP버튼을 누르면 u층만큼 엘리베이터가 올라가고, DOWN버튼을 누르면 d층만큼 내려간다. (u층 위, d층 아래에 해당하는 층이 없을 때는, 엘리베이터는 움직이지 않는다)

상근이의 인터뷰는 g층에서 진행되고, 이 건물에는 총 f층이 있다. 상근이는 g층에 도달하려면 버튼을 적어도 몇 번 눌러야 하는지 구하는 프로그램을 작성하시오. 만약, 엘리베이터로 그 층에 갈 수 없다면, "use the stairs"를 출력한다.
입력

첫째 줄에 f, s, g, u, d가 주어진다. (1 ≤ s,g ≤ f ≤ 1000000, 0 ≤ u,d ≤ 1000000) 건물은 1층부터 시작한다. 가장 높은 층은 f층이다.
출력

첫째 줄에 상근이가 s층에서 g층으로 가기 위해 눌러야 하는 버튼의 수의 최소값을 출력한다. 만약, 엘리베이터로 이동할 수 없을 때는 "use the stairs"를 출력한다.
예제 입력
10 1 10 2 1

예제 출력
6

*/
#include<iostream>
using namespace std;
int main(){
    // 10 1 10 2 1
    // 6
    int f,s,g,u,d;


}
