#include<stdio.h>
// ÀÚ¸´¼öÀÇ Á¦°öÀ» µ¹·ÁÁÖ´Â ÇÔ¼ö
int npow(int num){
	int sum=0;
	while(num){
		sum=sum+(num%10)*(num%10);
		num=num/10;
	}
	return sum;
}
int a[1001]={-1}; // ¹è¿­ ÃÊ±âÈ­ ( -1 ÃÊ±â°ª , 0 : 1È¸ ÂüÁ¶ 1 : 2È¸ÂüÁ¶(Çàº¹ÇÑ ¼ö°¡ ¾Æ´Ï´Ù))
int main(){
	int n=0,ch=0,i=0;
	scanf("%d",&n);
	for(i=n;i>0;i--){ // ÁÖ¾îÁø Á¤¼öº¸´Ù ÀÛ°Å³ª °°Àº Á¤¼ö nÀ» °¨¼ÒÇÏ¸é¼­ ºñ±³
		ch=npow(i); // Á¦°ö¼ö¸¦ ±¸ÇÔ
		do{			
			if(ch==1) { // Çàº¹ÇÑ ¼ö
				printf("%d",i);
				return 0;
			}
			else{ // Çàº¹ÇÑ ¼ö°¡ µÇ´ÂÁö »ìÆìº½
				if(a[ch]==1) break; // 2È¸ÂüÁ¶ Çàº¹ÇÑ ¼ö°¡ ¾Æ´Ô
				else{
					a[ch]++; // ÇØ´ç ¼ýÀÚÀÇ ÂüÁ¶ , ÀÌ ºÎºÐÀº ¼öÁ¤ÇØ¾ß ½ÇÇà½Ã°£ÀÌ ´õ ´ÜÃàµÉ µí
				}
			}
			ch = npow(ch); // Á¦°ö¼ö¸¦ ±¸ÇÔ
		}while(1);		
	}
	return 0;
}

	